model {
  faster_rcnn {
    num_classes: 90
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 300
        max_dimension: 500
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_resnet_v2"
      first_stage_features_stride: 8
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 8
        width_stride: 8
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_atrous_rate: 2
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.009999999776482582
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.699999988079071
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_classification_loss {
      weighted_dice_classification_loss {
        squared_normalization: true
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6000000238418579
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 6
  batch_queue_capacity: 2
  num_batch_queue_threads: 1
  prefetch_queue_capacity: 1
  data_augmentation_options {
    random_crop_to_aspect_ratio {
    },
    random_horizontal_flip {
      probability: 0.2
    },
    random_adjust_brightness {
    },
    random_adjust_contrast {
    },
    random_patch_gaussian {
      random_coef : 0.75
      max_patch_size : 100
    }
  }
  keep_checkpoint_every_n_hours: 2.0
  optimizer {
    adam_optimizer {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0
          schedule {
            step: 1000
            learning_rate: .001
          }
          schedule {
            step: 40000
            learning_rate: .0001
          }
          schedule {
            step: 100000
            learning_rate: .00003
          }
          schedule {
            step: 350000
            learning_rate: .000008
          }
          warmup: true
        }
      }
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/home/fortson/alnah005/transferLearning/md_v4.1.0_checkpoint/model.ckpt"
  load_all_detection_checkpoint_vars: true
  fine_tune_checkpoint_type: "detection"
}
train_input_reader {
  label_map_path: "/home/fortson/alnah005/transferLearning/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/home/fortson/alnah005/transferLearning/data/train-?????-of-00001.tfrecord"
  }
  queue_capacity: 2
  min_after_dequeue: 1
  max_number_of_boxes: 200
}
eval_config {
  num_visualizations: 20
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  min_score_threshold: 0.0
}
eval_input_reader {
  label_map_path: "/home/fortson/alnah005/transferLearning/label_map.pbtxt"
  shuffle: true
  num_readers: 1
  tf_record_input_reader {
    input_path: "/home/fortson/alnah005/transferLearning/data/eval-?????-of-00001.tfrecord"
  }
  queue_capacity: 2
  min_after_dequeue: 1
}
